![alt text](https://www.nlab.org.uk/wp-content/uploads/NLABBlue.png)
# FBA Computing Session Week 6:

**More Pandas**

The aim of this tutorial is to cover additional methods available within Pandas that could be useful when preprocessing the data.

We'll explore
- how to deal with missing (NaN) values;
- how encoding and decoding is performed;
- how to group and aggregate the data; and
- how to change format from wide to long and back.

**Import Libraries**

In [2]:
import pandas as pd
import numpy as np

**Step A1: How to deal with NaNs in NumPy?**

In [3]:
a = [[1,2,np.nan],[4,5,6]]
# np.mean(a)
np.nanmean(a)
# [[1,2,3],[4,5,6]]
# [[1,2,np.nan],[4,5,6]]

np.float64(3.6)

In [5]:
# Is there a method that can help?
np.nanmedian(a)

np.float64(4.0)

**Step A2: NaNs in Pandas?**

Let's create a sample DataFrame with missing values to work with.

In [6]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [6, np.nan, 8, np.nan, 10],
    'C': [11, 12, 13, 14, 15]
}

df = pd.DataFrame(data)

In [7]:
df

     A     B   C
0  1.0   6.0  11
1  2.0   NaN  12
2  NaN   8.0  13
3  4.0   NaN  14
4  5.0  10.0  15

**Step A3: Identifying Missing Values**

To identify missing values in your DataFrame, you can use the .isna()` or `.isnull()` method. It will return a DataFrame of the same shape, with Booleans: `True` where the values are missing (NaN) and `False` where values are not missing.

In [8]:
# Your code here
missing_values=df.isnull()

print(missing_values)

       A      B      C
0  False  False  False
1  False   True  False
2   True  False  False
3  False   True  False
4  False  False  False

**Step A4: Counting Missing Values**

To count the missing values in each column, you can use the `sum()` function on the DataFrame returned from `isna()`.

In [9]:
# Your code here
missing_count=missing_values.sum()
print(missing_count)

A    1
B    2
C    0
dtype: int64

**Step A5: Removing Rows with Missing Values**

You can remove rows with missing values using the `dropna()` function.

In [10]:
# Your code here
# df_cleaned= df.dropna(axis=1)
df_cleaned= df.dropna()
print(df_cleaned)

     A     B   C
0  1.0   6.0  11
4  5.0  10.0  15

In [11]:
df_cleaned

     A     B   C
0  1.0   6.0  11
4  5.0  10.0  15

This will remove all rows that contain at least one missing value. If you want to remove columns with missing values, you can use `df.dropna(axis=1)`.

**Step A6: Filling Missing Values**

To fill missing values, you can use the `fillna()` function. You can replace NaNs with a specific value or with the mean, median, or any other statistic.

In [12]:
df_filled = df.fillna(0)  # Replace NaNs with 0
print(df_filled)

     A     B   C
0  1.0   6.0  11
1  2.0   0.0  12
2  0.0   8.0  13
3  4.0   0.0  14
4  5.0  10.0  15

In [13]:
df.mean()
# unlike NumPy mean works with NaNs

A     3.0
B     8.0
C    13.0
dtype: float64

In [14]:
# Your code here
df_mean_filled=df_filled.mean()
print(df_mean_filled)

A     2.4
B     4.8
C    13.0
dtype: float64

**Step A7: Interpolation**

Pandas provides interpolation methods for filling missing values. For example, to perform linear interpolation, you can use:

In [15]:
df_interpolated = df.interpolate()
print(df_interpolated)

     A     B   C
0  1.0   6.0  11
1  2.0   7.0  12
2  3.0   8.0  13
3  4.0   9.0  14
4  5.0  10.0  15

That's it! You've now learned how to deal with missing values in Python using Pandas and NumPy, including identifying, counting, removing, filling, and interpolating missing values. Apply it to your datasets.

In more complex scenarios, you might want to use more advanced imputation techniques. For example, you can use scikit-learn's SimpleImputer to fill missing values with the mean, median, or a custom strategy.

**Common Pitfall:** when to use inplace=True

Many Pandas functions can take an argument of `inplace=True`. The difference between in-place and "normal" function calls is that in-place modifies the data object directly while "normal" functions return a copy (or a view).

It's important to use `inplace=True` with care because it modifies the original object, and you cannot easily revert the changes. Make sure you have a backup of your data or a clear understanding of the consequences before using `inplace=True`. Additionally, in some cases, it can be better to create a new DataFrame or Series and assign the modified result to it instead of using `inplace=True`.

**Step B1: Create a Sample DataFrame**

Let's create a sample DataFrame with a categorical variable that we will encode and decode.

In [16]:
data = {
    'Category': ['A', 'B', 'A', 'C', 'B', 'C', 'A'],
}

df = pd.DataFrame(data)

# Encode the 'Category' column
df['Encoded_Category'] = df['Category'].map({'A': 0, 'B': 1, 'C': 2})

# Create a valid dictionary for decoding
category_dict = {0: 'A', 1: 'B', 2: 'C'}

# Decode the 'Encoded_Category' column
df['Decoded_Category'] = df['Encoded_Category'].map(category_dict)

print(df)

  Category  Encoded_Category Decoded_Category
0        A                 0                A
1        B                 1                B
2        A                 0                A
3        C                 2                C
4        B                 1                B
5        C                 2                C
6        A                 0                A

In [17]:
df

  Category  Encoded_Category Decoded_Category
0        A                 0                A
1        B                 1                B
2        A                 0                A
3        C                 2                C
4        B                 1                B
5        C                 2                C
6        A                 0                A

**Step B2: One-hot Encoding**

To encode categorical variables, you can use one-hot encoding. Pandas provides a convenient method called `pd.get_dummies()` for this purpose (note, 'dtype = int' option is needed to get 0 & 1, instead of booleans by default).

In [18]:
data = {
    'Category': ['A', 'B', 'C', 'A', 'B', 'C']
}
df = pd.DataFrame(data)
# Perform one-hot encoding
encoded_df = pd.get_dummies(df, dtype = int)
print(encoded_df)

   Category_A  Category_B  Category_C
0           1           0           0
1           0           1           0
2           0           0           1
3           1           0           0
4           0           1           0
5           0           0           1

In [19]:
encoded_df

   Category_A  Category_B  Category_C
0           1           0           0
1           0           1           0
2           0           0           1
3           1           0           0
4           0           1           0
5           0           0           1

This will convert the categorical variable 'Category' into binary columns for each category.

Now, let's say you want to convert the one-hot encoded columns back to the original categorical variable.

**Step B3: Decoding the DataFrame**

To decode the DataFrame, use `idxmax(axis=1)` to find the column with the highest value (1) for each row, and then we use `str.replace()` to remove the "Category_" prefix from the column names. Finally, create a new 'Decoded_Category' column in the DataFrame with the decoded values.

In [22]:
# Decode the one-hot encoded columns and remove the "Category_" prefix

decoded_cat= encoded_df.idxmax(axis=1).str.replace('Category_','')
# Create a new 'Decoded_Category' column
df['Decoded_Category'] = decoded_cat


print(df)

  Category Decoded_Category
0        A                A
1        B                B
2        C                C
3        A                A
4        B                B
5        C                C

Explore other encoding options...

- Frequency (Count) Encoding: This method replaces categories with the frequency (count) of each category in the dataset. It can be useful when the frequency of categories is relevant information.

- Target Encoding (Mean Encoding): In target encoding, the categories are replaced with the mean of the target variable for each category. It's often used in classification tasks.

**Step B4: Frequency (Count) Encoding:**

Let's say you have a Data Frame with a categorical column Color, and you want to perform frequency encoding on it:

In [4]:
data = {
    'Color': ['Red', 'Blue', 'Red', 'Green', 'Blue', 'Green', 'Red', 'Red']
}

df = pd.DataFrame(data)

# Calculate the frequency of each category and create a mapping
frequency_map = df['Color'].value_counts().to_dict()

# Apply frequency encoding to the 'Color' column
df['Color_Frequency'] = df['Color'].map(frequency_map)

print(df)

   Color  Color_Frequency
0    Red                4
1   Blue                2
2    Red                4
3  Green                2
4   Blue                2
5  Green                2
6    Red                4
7    Red                4

In this example, the 'Color_Frequency' column will contain the count (frequency) of each color in the 'Color' column.

**Step C1: Grouping Data**

You can use the `groupby` function to group the data based on a specific column. For example, let's group the data by the 'Category' column:

In [5]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'A'],
    'Value': [10, 20, 15, 25, 12, 18]
}

df = pd.DataFrame(data)
grouped = df.groupby('Category')

**Step C2: Aggregating Data**

Once you have grouped the data, you can perform various aggregation operations. Some common aggregation methods include `sum()`, `mean()`, `max()`, `min()`, and `count()`. For instance, to find the sum of 'Value' within each category:

In [7]:
# Your code here
df_mean=grouped.mean()
print(df_mean)

          Value
Category
A         13.75
B         22.50

**Step C3: Multiple Aggregations**

You can perform multiple aggregations at once using the `agg` method. For instance, to find both the sum and mean of 'Value' by category:

In [10]:
# Your code here
print(df.agg({'Value':['mean','sum']}))

           Value
mean   16.666667
sum   100.000000

**Step C4: Resetting the Index**

By default, the grouped column becomes the index. Reset the index and keep the results as columns:

In [14]:
# make use of .reset_index()
agg_result=df.reset_index()

Also, practice grouping by multiple columns on a dataset with more columns!

**Step D1: Wide vs Long Formats**

Let's practice with Halloween data you (might have) used for Tableau Practical. We prefered to tranform the file outside the Tableau and we will learn how to do it in Python. Still, it is possible to do that in Tableau by pivoting the table.

In [15]:
!wget -O week6_data.zip "https://drive.google.com/uc?export=download&id=1_cmPeepnFq4EDAvlnsFsFR9pNKiCo-jo"
!unzip week6_data.zip

--2025-11-08 23:39:50--  https://drive.google.com/uc?export=download&id=1_cmPeepnFq4EDAvlnsFsFR9pNKiCo-jo
Resolving drive.google.com (drive.google.com)... 142.251.30.102, 142.251.30.113, 142.251.30.101, ...
Connecting to drive.google.com (drive.google.com)|142.251.30.102|:443... connected.
HTTP request sent, awaiting response... 303 See Other
Location: https://drive.usercontent.google.com/download?id=1_cmPeepnFq4EDAvlnsFsFR9pNKiCo-jo&export=download [following]
--2025-11-08 23:39:50--  https://drive.usercontent.google.com/download?id=1_cmPeepnFq4EDAvlnsFsFR9pNKiCo-jo&export=download
Resolving drive.usercontent.google.com (drive.usercontent.google.com)... 142.250.129.132, 2a00:1450:4009:c08::84
Connecting to drive.usercontent.google.com (drive.usercontent.google.com)|142.250.129.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 281 [application/octet-stream]
Saving to: ‘week6_data.zip’

week6_data.zip      100%[===================>]     281  --.-KB/s    in 0s

2025-11-08 23:39:53 (6.09 MB/s) - ‘week6_data.zip’ saved [281/281]

Archive:  week6_data.zip
  inflating: trick_or_treat.csv

In [16]:
import pandas as pd
df_wide = pd.read_csv('trick_or_treat.csv')
df_wide

   Year  6pm  6:30pm  7pm  7:30pm  8pm  8:15pm
0  2016   22     138  226     226  147      63
1  2015   13     135  188     187  144      80
2  2014    0     106   91     124  115      18
3  2013   33     119   81      70   68      20
4  2012    0     147  163     232  111      20
5  2011    0     172  195     252  197      53
6  2010    0     172  179     187  185       3
7  2009    0      52  177     150  143      20
8  2008    0      75  117     147  144       9

**Step D2: Converting from Wide to Long Format**

To convert from wide to long format, you can use the `melt` function. You need to specify which columns to keep as identifier variables (e.g., 'Year') and which columns to melt into a new variable. In this example, we will melt the timeslot columns into a 'Time' column:

In [17]:
df_long = pd.melt(df_wide, id_vars=['Year'], var_name='Time', value_name='Counts')
df_long

    Year    Time  Counts
0   2016     6pm      22
1   2015     6pm      13
2   2014     6pm       0
3   2013     6pm      33
4   2012     6pm       0
5   2011     6pm       0
6   2010     6pm       0
7   2009     6pm       0
8   2008     6pm       0
9   2016  6:30pm     138
10  2015  6:30pm     135
11  2014  6:30pm     106
12  2013  6:30pm     119
13  2012  6:30pm     147
14  2011  6:30pm     172
15  2010  6:30pm     172
16  2009  6:30pm      52
17  2008  6:30pm      75
18  2016     7pm     226
19  2015     7pm     188
20  2014     7pm      91
21  2013     7pm      81
22  2012     7pm     163
23  2011     7pm     195
24  2010     7pm     179
25  2009     7pm     177
26  2008     7pm     117
27  2016  7:30pm     226
28  2015  7:30pm     187
29  2014  7:30pm     124
30  2013  7:30pm      70
31  2012  7:30pm     232
32  2011  7:30pm     252
33  2010  7:30pm     187
34  2009  7:30pm     150
35  2008  7:30pm     147
36  2016     8pm     147
37  2015     8pm     144
38  2014     8pm     115
39  2013     8pm      68
40  2012     8pm     111
41  2011     8pm     197
42  2010     8pm     185
43  2009     8pm     143
44  2008     8pm     144
45  2016  8:15pm      63
46  2015  8:15pm      80
47  2014  8:15pm      18
48  2013  8:15pm      20
49  2012  8:15pm      20
50  2011  8:15pm      53
51  2010  8:15pm       3
52  2009  8:15pm      20
53  2008  8:15pm       9

The resulting DataFrame (**`df_long`**) will be in long format, where each row represents a unique combination of 'Year' and 'Time'.

**Step D3: Converting from Long to Wide Format**

To convert data back from long to wide format, you can use the `pivot` function. This requires specifying which columns to use as the index, columns, and values.

In [18]:
df_wide_back = df_long.pivot(index='Year', columns='Time', values='Counts').reset_index()
df_wide_back

Time  Year  6:30pm  6pm  7:30pm  7pm  8:15pm  8pm
0     2008      75    0     147  117       9  144
1     2009      52    0     150  177      20  143
2     2010     172    0     187  179       3  185
3     2011     172    0     252  195      53  197
4     2012     147    0     232  163      20  111
5     2013     119   33      70   81      20   68
6     2014     106    0     124   91      18  115
7     2015     135   13     187  188      80  144
8     2016     138   22     226  226      63  147

In [ ]:
# sorting rows and columns?

The `pivot` function reshapes the data back into wide format using 'Year' as the index, 'Time' as the columns, and 'Counts' as the values. The `reset_index()` function is used to restore 'Year' as a column.

**Step D4: Useful Function for SQL**

`.iterrows()` in Pandas, allows to loop through each row in a DataFrame and access the values in each row.

for index, row in df_long[df_long['Time']=='8pm'].iterrows():
    print(f"{index-35}. In {row['Year']} there were {row['Counts']} trick-or-treaters at 8PM.")

**Final Remarks: Input / Output**

For example, `pd.read_csv` will read in a CSV file and create a `DataFrame`.

Getting data out again can also be done in several ways: `df.to_numpy()` to create numpy arrays or `df.to_csv("filename.csv")` to write out to a CSV file.